RT-Thread/rt-thread/bsp/stm32/libraries/STM32MPxx_HAL/CMSIS/Device/ST/STM32MP1xx/Source/Templates/gcc/startup_stm32mp157a_cm4.s
  .weak      USART3_IRQHandler                   
  .thumb_set USART3_IRQHandler,Default_Handler
                                           
  .weak      EXTI10_IRQHandler
  .thumb_set EXTI10_IRQHandler,Default_Handler
                                    
  .weak      RTC_TIMESTAMP_IRQHandler
  .thumb_set RTC_TIMESTAMP_IRQHandler,Default_Handler
                    
  .weak      EXTI11_IRQHandler
  .thumb_set EXTI11_IRQHandler,Default_Handler

  .weak      TIM8_BRK_IRQHandler
  .thumb_set TIM8_BRK_IRQHandler,Default_Handler
                   
  .weak      TIM8_UP_IRQHandler
  .thumb_set TIM8_UP_IRQHandler,Default_Handler
                   
  .weak      TIM8_TRG_COM_IRQHandler
  .thumb_set TIM8_TRG_COM_IRQHandler,Default_Handler
   
  .weak      TIM8_CC_IRQHandler                  
  .thumb_set TIM8_CC_IRQHandler,Default_Handler
                                     
  .weak      DMA1_Stream7_IRQHandler             
  .thumb_set DMA1_Stream7_IRQHandler,Default_Handler
                                            
  .weak      FMC_IRQHandler                      
  .thumb_set FMC_IRQHandler,Default_Handler
                                               
  .weak      SDMMC1_IRQHandler
  .thumb_set SDMMC1_IRQHandler,Default_Handler
                                               
  .weak      TIM5_IRQHandler                     
  .thumb_set TIM5_IRQHandler,Default_Handler
                                               
  .weak      SPI3_IRQHandler                     
  .thumb_set SPI3_IRQHandler,Default_Handler
                                               
  .weak      UART4_IRQHandler                    
  .thumb_set UART4_IRQHandler,Default_Handler
                                              
  .weak      UART5_IRQHandler                    
  .thumb_set UART5_IRQHandler,Default_Handler
                                              
  .weak      TIM6_IRQHandler
  .thumb_set TIM6_IRQHandler,Default_Handler
                     
  .weak      TIM7_IRQHandler                     
  .thumb_set TIM7_IRQHandler,Default_Handler
                      
  .weak      DMA2_Stream0_IRQHandler             
  .thumb_set DMA2_Stream0_IRQHandler,Default_Handler
                                    
  .weak      DMA2_Stream1_IRQHandler             
  .thumb_set DMA2_Stream1_IRQHandler,Default_Handler
                                     
  .weak      DMA2_Stream2_IRQHandler             
  .thumb_set DMA2_Stream2_IRQHandler,Default_Handler
                                      
  .weak      DMA2_Stream3_IRQHandler             
  .thumb_set DMA2_Stream3_IRQHandler,Default_Handler
                                      
  .weak      DMA2_Stream4_IRQHandler             
  .thumb_set DMA2_Stream4_IRQHandler,Default_Handler
                                   
  .weak      ETH1_IRQHandler                      
  .thumb_set ETH1_IRQHandler,Default_Handler
                                           
  .weak      ETH1_WKUP_IRQHandler                 
  .thumb_set ETH1_WKUP_IRQHandler,Default_Handler
  
  .weak      ETH1_LPI_IRQHandler                 
  .thumb_set ETH1_LPI_IRQHandler,Default_Handler 
                       
  .weak      EXTI6_IRQHandler
  .thumb_set EXTI6_IRQHandler,Default_Handler
                                         
  .weak      EXTI7_IRQHandler
  .thumb_set EXTI7_IRQHandler,Default_Handler

  .weak      EXTI8_IRQHandler
  .thumb_set EXTI8_IRQHandler,Default_Handler

  .weak      EXTI9_IRQHandler
  .thumb_set EXTI9_IRQHandler,Default_Handler

  .weak      DMA2_Stream5_IRQHandler             
  .thumb_set DMA2_Stream5_IRQHandler,Default_Handler
                                     
  .weak      DMA2_Stream6_IRQHandler             
  .thumb_set DMA2_Stream6_IRQHandler,Default_Handler
                                     
  .weak      DMA2_Stream7_IRQHandler             
  .thumb_set DMA2_Stream7_IRQHandler,Default_Handler
                                     
  .weak      USART6_IRQHandler                   
  .thumb_set USART6_IRQHandler,Default_Handler
                                             
  .weak      I2C3_EV_IRQHandler                  
  .thumb_set I2C3_EV_IRQHandler,Default_Handler
                                                
  .weak      I2C3_ER_IRQHandler                  
  .thumb_set I2C3_ER_IRQHandler,Default_Handler
                                                
  .weak      USBH_OHCI_IRQHandler
  .thumb_set USBH_OHCI_IRQHandler,Default_Handler
                        
  .weak      USBH_EHCI_IRQHandler
  .thumb_set USBH_EHCI_IRQHandler,Default_Handler
                        
  .weak      EXTI12_IRQHandler
  .thumb_set EXTI12_IRQHandler,Default_Handler

  .weak      EXTI13_IRQHandler
  .thumb_set EXTI13_IRQHandler,Default_Handler
                                        
  .weak      DCMI_IRQHandler                     
  .thumb_set DCMI_IRQHandler,Default_Handler

  .weak      HASH1_IRQHandler
  .thumb_set HASH1_IRQHandler,Default_Handler

  .weak      FPU_IRQHandler                      
  .thumb_set FPU_IRQHandler,Default_Handler
  
  .weak      UART7_IRQHandler                    
  .thumb_set UART7_IRQHandler,Default_Handler
  
  .weak      UART8_IRQHandler                    
  .thumb_set UART8_IRQHandler,Default_Handler
  
  .weak      SPI4_IRQHandler                     
  .thumb_set SPI4_IRQHandler,Default_Handler
  
  .weak      SPI5_IRQHandler                     
  .thumb_set SPI5_IRQHandler,Default_Handler
  
  .weak      SPI6_IRQHandler                     
  .thumb_set SPI6_IRQHandler,Default_Handler
  
  .weak      SAI1_IRQHandler                     
  .thumb_set SAI1_IRQHandler,Default_Handler
  
  .weak      LTDC_IRQHandler                     
  .thumb_set LTDC_IRQHandler,Default_Handler
  
  .weak      LTDC_ER_IRQHandler                  
  .thumb_set LTDC_ER_IRQHandler,Default_Handler
  
  .weak      SAI2_IRQHandler                     
  .thumb_set SAI2_IRQHandler,Default_Handler
     
  .weak      QUADSPI_IRQHandler                  
  .thumb_set QUADSPI_IRQHandler,Default_Handler
  
  .weak      LPTIM1_IRQHandler
  .thumb_set LPTIM1_IRQHandler,Default_Handler
  
  .weak      CEC_IRQHandler                      
  .thumb_set CEC_IRQHandler,Default_Handler
     
  .weak      I2C4_EV_IRQHandler                  
  .thumb_set I2C4_EV_IRQHandler,Default_Handler
  
